san99tiago/IOT_EIA/PIC18F2550/LEARNING PIC/PIC_05_SERIAL_1/SERIAL_1.X/serial_main.c
//CODIGO RECEPTOR DE SERIAL CON OTRO PIC18F2550 ENVIANDO CARACTER "A"
//Author: Santiago Garcia Arango , Marzo 2020, PIC18F2550

//Libreria para compilar en "C" y traer header de bits de configuracion
#include <xc.h>
#include "config.h"  //No olvidar incluir estos

//Librerias para la comunicacion serial correcta
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>

//Definimos frecuencia de crystal externo como 16 MHz
#define _XTAL_FREQ 16000000

//Se crea variable bandera para efectuar cambios en LEDs por info serial 
int bandera = 0;

void main(void) {
    //----------INICIALIZAMOS CLK EXTERNO Y PINES "AN" COMO DIGITALES-----------
    //Se indica CLK del sistema como "primary oscilator" (osea externo: Crystal)
    OSCCONbits.SCS = 0b00;   
    //Todos los registros de AN0,AN1,AN2...AN12 activados como digitales
    ADCON1 = 0b1111;

    //------=--------PINES PARA SALIDAS INDICADORES DE LEDs----------------
    //Se indican pines B3 y C2 como salidas (0 es output)
    TRISBbits.RB3 = 0;
    TRISCbits.RC2 = 0;
    
    //Se inicializan pines B3 y C2 en ON y OFF (respectivamente) al inicio
    LATBbits.LB3 = 1;
    LATCbits.LC2 = 0;

    //-----------CONFIGURACION PARA COMUNICACION SERIAL UART--------------------
    //Primero se activan RC6 y RC7 en "1" (ver instrucciones datasheet)
    TRISCbits.RC6 = 1; //Puerto TX como input para configuraciones
    TRISCbits.RC7 = 1; //Puerto RX como input para configuraciones

    //Configuraciones para el BAUD RATE
    BAUDCONbits.BRG16 =0; //8 bit Baud rate generator
    TXSTAbits.BRGH = 0; //Modo asincrono de baja velocidad de baud rate
    SPBRG = 24;  //Valor de "n" para activar Baud Rate de aprox 9600

    //Activamos el modo Asincrono de  transmision serial
    TXSTAbits.SYNC = 0; //Elegimios EUSART tipo Asincrono
    RCSTAbits.SPEN  = 1; //Activamos puerto serial
    
    //Habilitamos bit de transmision (ver datasheet)
    TXSTAbits.TXEN = 1; //Se actvia transmision (y por ende bandera TXIF)


    //Configuramos la recepcion correcta (con interrupciones)
    RCSTAbits.CREN = 1;//Habilitamos recepción por el puerto RX
    PIE1bits.RCIE = 1;//Habilitamos interrupcion asociada al serial (RCIE)
    
    //Como usaremos interrupciones, se deben habilitar globales y perifericas
    INTCONbits.PEIE = 1; //Habilito interrupcion periferica
    INTCONbits.GIE = 1;//Habilito interrupcion global

    //---------------FINALIZACION DE COMUNICACION SERIAL------------------------
    //Luego de efectuar configuraciones, se activan TX y RX segun su funcion
    TRISCbits.RC6 = 0; //Puerto TX como output
    TRISCbits.RC7 = 1; //Puerto RX como input
  

    while (1){
        //En caso de activar bandera desde interrupciones (por RX serial)
        if (bandera == 1){
            //Cambiamos estado de los LEDs de salida para ver recepcion
            LATBbits.LB3 = !LATBbits.LB3;  //Cambiamos estado pin B3
            LATCbits.LC2 = !LATCbits.LC2;  //Cambiamos estado pin C2
            __delay_ms(50);
            bandera = 0;  //Reseteamos bandera
        }
    } 
  return;
}

//DEFINIMOS LA FUNCION ASOCIADA A LAS INTERRUPCIONES (Recepcion Serial)
  void __interrupt() isr(){
      //si se levanta bandera de interrupcion asociada a Serial receptor
      if(PIR1bits.RCIF){
        //Se leen los 8bits recibidos (estan en registro RCREG, ver datasheet)
        char recibido = RCREG;
        
        //Si caracter es 'A', entonces activamos bandera, de lo contrario NO
        if (recibido == 'A'){
            bandera = 1;
        }
        //Se baja bandera asociada a la interrupcion del serial RX
        PIR1bits.RCIF = 0;
      }
  }
